In [61]:
import pandas as pd
import seaborn as sb

## Dictionary

##### use 'df_1=pd.DataFrame(data)' convert dictonary to pandas data frame

In [63]:
data={
    "Name":['Alice','Bob','Charlie','David'],
    "Age":["25","22","27","30"],#Sorted asc string
    "Salary":[50000,"60000",None,"75000"],# Mixed types
    "Joing_Date":["2024-2-03","2023-02-22","2025-05-25","2020-08-15"], #Stored string
    }
print(data)

{'Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': ['25', '22', '27', '30'], 'Salary': [50000, '60000', None, '75000'], 'Joing_Date': ['2024-2-03', '2023-02-22', '2025-05-25', '2020-08-15']}

In [65]:
df_1=pd.DataFrame(data)
print(df_1)

      Name Age Salary  Joing_Date
0    Alice  25  50000   2024-2-03
1      Bob  22  60000  2023-02-22
2  Charlie  27   None  2025-05-25
3    David  30  75000  2020-08-15

##### Convert Age column in to integer

In [67]:
df_1['Age']=df_1['Age'].astype(int)

##### Convert Salary to float

In [69]:
df_1["Salary"]=pd.to_numeric(df_1["Salary"]) #Convert and handle error

In [71]:
print("Before Conversion:\n",df_1.dtypes)

Before Conversion:
 Name           object
Age             int32
Salary        float64
Joing_Date     object
dtype: object

##### Activity 1 Convert Age to data frame

In [73]:
data={
    "Name":["John","Emma","Liam","Olivia"],
    "Age":["23","27","22","30"]
}
df_2=pd.DataFrame(data)
print(df_2)

     Name Age
0    John  23
1    Emma  27
2    Liam  22
3  Olivia  30

In [75]:
df_2["Age"]=df_2["Age"].astype(int) 
print(df_2)

     Name  Age
0    John   23
1    Emma   27
2    Liam   22
3  Olivia   30

#### 2.Handling missing values

##### You can remove, or asign mean, median, mode missing value. You can do below things for missing value
##### drop missing value = dropna()
##### filter missing value = isnull()
#### 1. check missing value. if missing value >20% Drop missing values. if missing value <20% check whether the variable is categorical or numerical. 
#### if it is numerical asign mean, median if it is categorical asign mode.

In [77]:
print(df_1)

      Name  Age   Salary  Joing_Date
0    Alice   25  50000.0   2024-2-03
1      Bob   22  60000.0  2023-02-22
2  Charlie   27      NaN  2025-05-25
3    David   30  75000.0  2020-08-15

In [79]:
df2=df_1['Salary'].isnull().sum() # sum of null values
print(df2)

1

In [23]:
df_1["Salary"].fillna(df_1["Salary"].mean(),inplace=True) #Fill missing valuesa

C:\Users\MSI\AppData\Local\Temp\ipykernel_12256\3560529404.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_1["Salary"].fillna(df_1["Salary"].mean(),inplace=True) #Fill missing valuesa

In [81]:
df_1["Salary"]=df_1["Salary"].fillna(df_1["Salary"].mean()) #Fill missing value using mean
print(df_1)

      Name  Age        Salary  Joing_Date
0    Alice   25  50000.000000   2024-2-03
1      Bob   22  60000.000000  2023-02-22
2  Charlie   27  61666.666667  2025-05-25
3    David   30  75000.000000  2020-08-15

In [33]:
df_1['Joing_Date']=pd.to_datetime(df_1['Joing_Date'])
print(df_1['Joing_Date'])

0   2024-02-03
1   2023-02-22
2   2025-05-25
3   2020-08-15
Name: Joing_Date, dtype: datetime64[ns]

In [37]:
print(df_1.columns)

Index(['Name', 'Age', 'Salary', 'Joing_Date'], dtype='object')

In [83]:
df_1.columns = df_1.columns.str.strip()  # Removes spaces around column names
print(df_1.columns)

Index(['Name', 'Age', 'Salary', 'Joing_Date'], dtype='object')

In [43]:
import difflib
col_name = difflib.get_close_matches("Joining_Date", df_1.columns, n=1)
print(col_name)

['Joing_Date']

In [87]:
df_1['Joining_Date'] = pd.to_datetime(df_1.get('Joining_Date', pd.NaT))
print(df_1['Joining_Date'])

0   NaT
1   NaT
2   NaT
3   NaT
Name: Joining_Date, dtype: datetime64[ns]

In [89]:
print(df_1)

      Name  Age        Salary  Joing_Date Joining_Date
0    Alice   25  50000.000000   2024-2-03          NaT
1      Bob   22  60000.000000  2023-02-22          NaT
2  Charlie   27  61666.666667  2025-05-25          NaT
3    David   30  75000.000000  2020-08-15          NaT